ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_dcc0_regs.xml
<module id="HSM_DCC0" HW_revision="" description="HSM DCC0 Registers">
	<register id="DCCGCTRL" width="32" page="0" offset="0" internal="0" description="DCC Global Control Register">
		<bitfield id="DCCENA" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="ERRENA" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="SINGLESHOT" description="" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="DONEENA" description="" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="DCCREV" width="32" page="0" offset="4" internal="0" description="DCC Revision ID">
		<bitfield id="MINOR" description="" begin="5" end="0" width="6" rwaccess="R"/>
		<bitfield id="CUSTOM" description="" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="MAJOR" description="" begin="10" end="8" width="3" rwaccess="R"/>
		<bitfield id="RTL" description="" begin="15" end="11" width="5" rwaccess="R"/>
		<bitfield id="FUNC" description="" begin="27" end="16" width="12" rwaccess="R"/>
		<bitfield id="SCHEME" description="" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="DCCCNTSEED0" width="32" page="0" offset="8" internal="0" description="Count0 Seed Value Register">
		<bitfield id="COUNTSEED0" description="" begin="19" end="0" width="20" rwaccess="RW"/>
	</register>
	<register id="DCCVALIDSEED0" width="32" page="0" offset="12" internal="0" description="Valid0 Seed Value Register">
		<bitfield id="VALIDSEED0" description="" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="DCCCNTSEED1" width="32" page="0" offset="16" internal="0" description="Count1 Seed Value Register">
		<bitfield id="COUNTSEED1" description="" begin="19" end="0" width="20" rwaccess="RW"/>
	</register>
	<register id="DCCSTAT" width="32" page="0" offset="20" internal="0" description="DCC Status Register">
		<bitfield id="ERRFLG" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DONEFLG" description="" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="DCCCNT0" width="32" page="0" offset="24" internal="0" description="Count0 Value Register">
		<bitfield id="COUNT0" description="" begin="19" end="0" width="20" rwaccess="R"/>
	</register>
	<register id="DCCVALID0" width="32" page="0" offset="28" internal="0" description="Valid0 Value Register">
		<bitfield id="VALID0" description="" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="DCCCNT1" width="32" page="0" offset="32" internal="0" description="Count1 Value Register">
		<bitfield id="COUNT1" description="" begin="19" end="0" width="20" rwaccess="R"/>
	</register>
	<register id="DCCCLKSRC1" width="32" page="0" offset="36" internal="0" description="Clock Source Selection Register 1">
		<bitfield id="CLKSRC1" description="" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="KEY" description="" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="DCCCLKSRC0" width="32" page="0" offset="40" internal="0" description="Clock Source Selection Register 0">
		<bitfield id="CLKSRC0" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="KEY" description="" begin="15" end="12" width="4" rwaccess="RW"/>
	</register>
	<register id="DCCGCTRL2" width="32" page="0" offset="44" internal="0" description="DCC Global Control Register 2">
		<bitfield id="CONT_ON_ERR" description="" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="FIFO_READ" description="" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="FIFO_NONERR" description="" begin="11" end="8" width="4" rwaccess="RW"/>
	</register>
	<register id="DCCSTATUS2" width="32" page="0" offset="48" internal="0" description="DCC FIFO Status Register">
		<bitfield id="COUNT0_FIFO_EMPTY" description="" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="VALID0_FIFO_EMPTY" description="" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="COUNT1_FIFO_EMPTY" description="" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="COUNT0_FIFO_FULL" description="" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="VALID0_FIFO_FULL" description="" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="COUNT1_FIFO_FULL" description="" begin="5" end="5" width="1" rwaccess="R"/>
	</register>
	<register id="DCCERRCNT" width="32" page="0" offset="52" internal="0" description="Error Count Register">
		<bitfield id="ERRCNT" description="" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
</module>
